{
    "title": "Hi! I'm Kaitlynn Chan",
    "profile": "Aspiring software engineer new grad and advocate for women in STEM, interested in securing businesses through cybersecurity.",
    "aboutMe":"I am an undergraduate student at Simon Fraser University, pursuing a degree in Computer Science with a minor in Business. Passionate about technology and community, I thrive on connecting with others, learning from their journeys, and seeking challenges that push me to grow. I have represented SFU in a global cybersecurity competition and played a key role as an early contributor in enhancing a startup.<br />Beyond academics, I am committed to fostering inclusivity in STEM, earning multiple grants and awards for impactful contributions.<br />Highlights:<ul><li>Leading a team of 10 over five months to organize a free outreach event for high school female and non-binary students, securing over $6,000 in sponsorships and empowering over 80 student to pursue a career in STEM.</li><li>Coordinating a networking event with the Women in Engineering club, connecting 70 students with industry mentors.</li><li>Establishing SFU’s first cross-institutional collaboration with a neighboring university — UBC — to strengthen intercollegiate relations.</li><li>Representing SFU at multiple conferences to advocate for diversity in STEM.</li></ul>",
    "profileImg": "../profile-pic.jpg",
    "links": {
        "github": "https://github.com/kaitlynnchan",
        "linkedin": "https://www.linkedin.com/in/kaitlynn-chan-3b2935162/",
        "resume": "https://drive.google.com/file/d/17RjmRSGnLhdQHUXH6xpLUb0Wcsnh-Ek7/view?usp=sharing"
    },
    "achievements":[
        {
            "name": "nwHacks Defang.io Prize Runner Up",
            "year": 2025
        },
        {
            "name": "CAN-CWIC Grant Recipient",
            "year": 2024
        },
        {
            "name": "Grace Hopper Celebration Grant Recipient",
            "year": 2023
        },
        {
            "name": "Ryan Wilk Mastercard Memorial Award",
            "year": 2023
        },
        {
            "name": "Visier Computer Science Award",
            "year": 2019
        },
        {
            "name": "West Point Grey Scholarship",
            "year": 2019
        },
        {
            "name": "BC Achievement Scholarship",
            "year": 2019
        }
    ],
    "projects":[
        {
            "name":"Connect Quest",
            "description":"This social interaction app prompts users with a daily challenge to get themselves outside and engaging with their community. Completing the challenge awards a user with points so they can compete for high scores with their friends.",
            "img":"../connect-quest.png",
            "link":"https://devpost.com/software/connect-quest"
        },
        {
            "name":"Dine Buddy",
            "description":"This Android app allows a users to login and find places on google maps to save.",
            "img":"../dine-buddy.jpg",
            "link":"https://github.com/kaitlynnchan/food-map"
        },
        {
            "name":"Chroma Scan",
            "description":"This Java application allows a user to select a source image and find the complimenting and dominant color from the source image.",
            "img":"../chroma-scan.png",
            "link":"https://github.com/kaitlynnchan/chroma-scan"
        },
        {
            "name":"Capture the Flag",
            "description":"A fun and engaging website game for try/CATCH participants (high school female and non-binary students) to learn about some CS basics and info about SFU Women in Computing Science.",
            "img":"../capture-the-flag.jpg",
            "link":"https://script.google.com/macros/s/AKfycbyMGdf1Crb_aFGOWAuZ4-cmHjji4w_Rpn-1MgYqFhW_GFZuttWDSQ8GG5E_rliyI0_KqQ/exec"
        },
        {
            "name":"Filomator",
            "description":"A file management desktop application that monitors folders for incoming files and moves them to their destination. Users input where they want files to go, what files to monitor and when.",
            "img":"../new-task-page.jpg",
            "link":"https://github.com/kaitlynnchan/Filomator"
        },
        {
            "name":"Recipe Extractor",
            "description":"This Chome extension pulls recipe information from a site and displays it to users.",
            "img":"../recipe-extractor.jpg",
            "link":"https://github.com/kaitlynnchan/recipe-extractor"
        },
        {
            "name":"Reel Deal",
            "description":"An immersive Android game where users search for the fishes implemented in Java. Users can choose how difficult they want to play and compete to improve their high scores.",
            "img":"../reeldeal-playing.jpg",
            "link":"https://github.com/kaitlynnchan/ReelDeal"
        },
        {
            "name":"Find It",
            "description":"A play on the game spot it, users match images on the cards and compete for a better high score. This Android game algorithmically creates cards and shuffles them where exactly 1 image matches with another card. Users are also able to import images from Flickr using the Flickr API or from their photo gallery.",
            "img":"../findit-playing.jpg",
            "link":"https://github.com/kaitlynnchan/FindIt"
        },
        {
            "name":"CShell",
            "description":"A command line interpreter that forks processes to allow multiple commands to be run efficiently and independently. Users can run a script of commands.",
            "img":"../cshell-ex2.jpg",
            "link":"https://replit.com/@kaitlynnchan/cshell"
        }
    ]
}
